# **Portafolio Actividad 1**
## **Consultas SQL**
---


> Nombres y Apellido autor: Carla Daniela Di Monno

> Asignatura: Herramientas de Base de Datos

## Instalación de dependencias necesarias
---------------------

In [ ]:
#!pip install sqlalchemy==1.4.4
!pip install sqlalchemy==2.0.2
!pip install ipython-sql

Collecting sqlalchemy==2.0.2
  Downloading SQLAlchemy-2.0.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.7/2.7 MB 10.5 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0.2) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0.2) (3.0.3)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.27
    Uninstalling SQLAlchemy-2.0.27:
      Successfully uninstalled SQLAlchemy-2.0.27
Successfully installed sqlalchemy-2.0.2
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.2)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 9.4 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.19.1

## Alcances de la Actividad
---

En esta actividad del portafolio de Herramientas de Base de Datos se responderán diversas preguntas sobre la actividad de una tienda de productos para mascotas **Love4Pets**, que ha creado una base de datos SQL con el fin de llevar un control de sus empleados, ventas y suministro de productos. Las consultas SQL nos permitirán abordar las cuestiones planteadas en cada uno de estos aspectos.

### Fuente de datos
La base de datos **love4pets.db** integra diferentes tablas, cada una almacena información relativa a un aspecto de la empresa, agrupando esta información en forma de campos.

Las tablas existentes en **love4pets.db** son:
*   Departamento
*   Empleado
*   Cliente
*   Mascota
*   Producto
*   Orden o Factura
*   Detalle_orden
*   Proveedor
*   Suministro


### Importación y carga de love4pets.db (SQL)

In [ ]:
# %reload_ext sql
%load_ext sql
%sql sqlite:///love4pets.db

## Exploración de datos

---

### **Ejercicio 1**
--------
*Complete el siguiente código para obtener un listado de los nombres, telefonos, y el correo electrónico de todos los clientes y asi contactarlos para notificarles de una promoción.*

Para obtener un listado de los *nombres, teléfonos y correos electrónicos* de todos los clientes de la tienda de mascotas **love4pets** debemos recurrir a la tabla de **cliente** de la base de datos. Para ello, en primer lugar, necesitamos conocer cuáles son los campos que posee dicha tabla para consultar sólo los que contienen la información que deseamos y no toda la tabla.
Entonces, observamos el diseño de la tabla mediante la siguiente instrucción:

In [ ]:
%sql PRAGMA table_info(cliente);

 * sqlite:///love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

Podemos observar que la tabla ***cliente*** contiene los siguientes 7 campos:

*   cliente_id
*   nombre
*   email
*   telefono
*   contacto
*   telefono_contacto
*   ciudad

Donde *cliente_id* es el único campo con registros de tipo entero, ya que el resto de los campos son de tipo texto.
Ahora que ya conocemos los campos, podemos realizar la siguiente consulta de selección SQL, mostrando solo los campos **nombre, telefono e email** para obtener el listado solicitado y notificar a los clientes de la promoción:

In [ ]:
%sql SELECT nombre AS "nombre_cliente", telefono AS "teléfono", email AS "correo_electrónico" FROM cliente;

 * sqlite:///love4pets.db
Done.

[('Mario Flores Gallardo', '036-15-36', 'marioflores@gmail.com'),
 ('Arnau Medina Garcia', '094-10-88', 'arnaumedina@gmail.com'),
 ('Ivan Medina Rubio', '083-08-72', 'ivanmedina@gmail.com'),
 ('Jan Vargas Santana', '780-65-24', 'vargasjan@gmail.com'),
 ('Carlos Costa Guerrero', '180-65-24', 'carloscostag@gmail.com'),
 ('Roberto Martin Ortega', '742-63-27', 'robertmartin@gmail.com'),
 ('Gabriel Gonzalez Ortega', '780-13-14', 'gabogonzo@gmail.com'),
 ('Rayan Leon Ferrer', '430-65-24', 'rayito@gmail.com'),
 ('Aitor Ruiz Sanchez', '780-77-24', 'aitorsanchez@gmail.com'),
 ('Eric Rubio Carrasco', '780-65-79', 'ericrubio@gmail.com'),
 ('Alberto Sanz Ruiz', '781-15-24', 'albert@gmail.com'),
 ('Jesus Medina Hernandez', '782-35-25', 'jmedinah@gmail.com'),
 ('Pol Moya Pena', '780-25-24', 'polmoya@gmail.com'),
 ('Jose Gallardo Rodriguez', '783-65-11', 'josegallardo@gmail.com'),
 ('Manuel Angel Gil', '733-65-16', 'manano@gmail.com')]

NOTA: Por una cuestión de prolijidad y que el listado esté bien identificado se utilizaron etiquetas para renombrar los campos en la consulta con un alias mediante la utilización del **comando AS**. Se mantendrá este formato a lo largo de toda la actividad.

Además, para facilitar la tarea de quién tenga que comunicarse con dichos clientes para ofrecer la promoción se ordenó el listado obtenido alfabéticamente por el campo "*nombre_cliente*" utilizando la cláusula ORDER BY (por default toma orden ascendente, A > Z).

In [ ]:
%sql SELECT nombre AS "nombre_cliente", telefono AS "teléfono", email AS "correo_electrónico" FROM cliente ORDER BY nombre;

 * sqlite:///love4pets.db
Done.

[('Aitor Ruiz Sanchez', '780-77-24', 'aitorsanchez@gmail.com'),
 ('Alberto Sanz Ruiz', '781-15-24', 'albert@gmail.com'),
 ('Arnau Medina Garcia', '094-10-88', 'arnaumedina@gmail.com'),
 ('Carlos Costa Guerrero', '180-65-24', 'carloscostag@gmail.com'),
 ('Eric Rubio Carrasco', '780-65-79', 'ericrubio@gmail.com'),
 ('Gabriel Gonzalez Ortega', '780-13-14', 'gabogonzo@gmail.com'),
 ('Ivan Medina Rubio', '083-08-72', 'ivanmedina@gmail.com'),
 ('Jan Vargas Santana', '780-65-24', 'vargasjan@gmail.com'),
 ('Jesus Medina Hernandez', '782-35-25', 'jmedinah@gmail.com'),
 ('Jose Gallardo Rodriguez', '783-65-11', 'josegallardo@gmail.com'),
 ('Manuel Angel Gil', '733-65-16', 'manano@gmail.com'),
 ('Mario Flores Gallardo', '036-15-36', 'marioflores@gmail.com'),
 ('Pol Moya Pena', '780-25-24', 'polmoya@gmail.com'),
 ('Rayan Leon Ferrer', '430-65-24', 'rayito@gmail.com'),
 ('Roberto Martin Ortega', '742-63-27', 'robertmartin@gmail.com')]

### **Ejercicio 2**
----
*Con el propósito actualizar la información de los clientes se quiere contactar a aquellos clientes que no tienen asociada una persona de contacto, para esto se pide que muestre de la tabla "cliente" los campos "nombre" y "telefono" de los clientes que no tienen un contacto registrado.*

Para consultar los datos de los clientes que no tienen asociada una persona de contacto, es decir que en principio no habrían completado ese campo y por lo cual el valor por defecto sería NULL (porque según vemos en la información de la tabla en el ejercicio 1 los nulos en este campo están permitidos), tendríamos que utilizar la **cláusula WHERE** para filtrar el caso donde el campo **contacto** tomará registros con *valores nulos (NULL)*.

In [ ]:
%sql SELECT nombre AS "nombre_cliente", telefono AS "teléfono" FROM cliente WHERE contacto IS NULL;

 * sqlite:///love4pets.db
Done.

[]

Se puede observar de la consulta realizada que **no se obtienen** registros cuyo contacto sea nulo (**NULL**). Sin embargo, si realizamos una consulta de toda la tabla, corroboramos que existen tres clientes que no tienen asociada una persona de contacto, por lo que evidentemente los datos en esta tabla se han insertado de otra manera.

In [ ]:
%sql SELECT * FROM cliente;

 * sqlite:///love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

Lo que sucede aquí es que para esos clientes, sin un nombre en el campo **contacto**, evidentemente dicho campo está editado pero no se completó con valores, entonces está en blanco o vacío. Por lo que en realidad la *consulta SQL correcta para este ejercicio* que contemplaría dicho caso y nos devuelve el listado de los nombres y teléfonos de los clientes sin personas de contacto sería la siguiente:

In [ ]:
%sql SELECT nombre AS "nombre_cliente", telefono AS "teléfono" FROM cliente WHERE (contacto='');

 * sqlite:///love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24')]

Finalmente, si no pudieramos ver la tabla completa y no tuvieramos certezas o forma de verificar como fueron insertados los datos, lo ideal sería realizar una consulta SQL que contemple ambos casos. Es decir, que analice si el campo tiene registros vacíos o nulos. De esta forma no cometeríamos errores perdiendo algún registro de clientes sin contacto. La consulta SQL utilizaría la **cláusula WHERE** con el **operador OR** y sería:

In [ ]:
%sql SELECT nombre AS "nombre_cliente", telefono AS "teléfono" FROM cliente WHERE (contacto='') OR (contacto IS NULL);

 * sqlite:///love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24')]

Observemos que para nuestro caso de análisis esta consulta da el mismo listado que la consulta anterior. Pero, si agregaramos algún registro con contacto nulo, nos devolvería los 3 anteriores más el nuevo registro tal como se muestra a continuación:

In [ ]:
%sql INSERT INTO cliente(cliente_id, nombre, telefono, ciudad) VALUES (16,"Carla Mana", "123456", "Segovia");

 * sqlite:///love4pets.db
1 rows affected.

[]

In [ ]:
%sql SELECT * FROM cliente WHERE (contacto='') OR (contacto IS NULL);

 * sqlite:///love4pets.db
Done.

[(2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (16, 'Carla Mana', None, '123456', None, None, 'Segovia')]

In [ ]:
%sql SELECT nombre AS "nombre_cliente", telefono AS "teléfono" FROM cliente WHERE (contacto='') OR (contacto IS NULL);

 * sqlite:///love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24'),
 ('Carla Mana', '123456')]

NOTA: Eliminamos esta última línea agregada a la BD con fines demostrativos, para seguir con la BD original para las próximas consultas y verificamos visualizando nuevamente la tabla completa.

In [ ]:
%sql DELETE FROM cliente WHERE cliente_id=16;

 * sqlite:///love4pets.db
0 rows affected.

[]

In [ ]:
%sql SELECT * FROM cliente;

 * sqlite:///love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

### **Ejercicio 3**
--------
Un empleado de la empresa Love4Pets se dió cuenta que un cliente dejó por accidente su celular, el empleado recuerda que alguno de sus apellidos era "Leon".

Se quiere que determinar a quien pertenece el celular extraviado, y en caso de ser posible avisar a su persona de contacto que el celular está a salvo y pueden pasar buscandolo en cualquier momento.
   
Se sabe que la tabla **"cliente"** tiene un campo **"nombre"** el cual contiene nombres y apellidos, el campo **"contacto"** que tiene el nombre de la persona de contacto y el campo **"telefono_contacto"** que tiene el telefono de la persona de contacto.

En este caso sabemos, por lo que recuerda el empleado, que podemos determinar a quién pertenece el celular extraviado y encontrar los datos del contacto de dicho cliente utilizando el patrón "Leon" sobre la columna **nombre**. Podemos entonces utilizar la consulta SQL con la **cláusula WHERE** y el **operador LIKE** de la siguiente manera:

In [ ]:
%sql SELECT nombre AS "nombre_y_apellido_cliente", contacto AS "nombre_contacto", telefono_contacto AS "teléfono_contacto" FROM cliente WHERE nombre LIKE "%Leon%";

 * sqlite:///love4pets.db
Done.

[('Rayan Leon Ferrer', 'Santiago Perez Ramos', '577-21-24')]

La instrucción anterior busca todos los clientes y los datos de su correspondiente contacto, cuyo campo *nombre_y_apellido_cliente* contiene la secuencia de caracteres "Leon" en alguna posición. Se determina inequívocamente quién es el cliente que extravió el celular, ya que el registro mostrado al realizar la consulta es único.

### **Ejercicio 4**
--------
La empresa Love4Pets considera hacer un descuento sobre los productos que cuestan entre 10 y 20 euros, y complementos vitamínicos.
      
Se requiere que liste las columnas "nombre", "descripcion", "precio" de productos a los que debe ser aplicado el descuento. ( asuma que los productos se encuentran en la tabla "producto" )
   
Asuma que el producto vitaminico no lleva acentos, generalmente estos productos tienen la palabra vitamina en la **"descripcion"** pero podria ser alguna variante como vitaminico o comenzar por mayusculas, el departamento de informática recomendó usar la función Like para esta busqueda.

Se interpreta del enunciado que los descuentos se realizarán en aquellos productos que cuestan entre 10 y 20 euros, como así también en aquellos que sean complementos vitamínicos. Es por ello, que para obtener el listado con los campos pedidos de esos productos, se realizará la consulta SQL a la tabla **producto** utilizando dichas condiciones en la **cláusula WHERE** con los **operadores BETWEEN, AND y OR**. Además, como los complementos vitamínicos pueden esta ingresados en el campo **descripción** como vitamina o alguna variante de vitamínico o comenzar con mayúsculas, se utiliza el **operador LIKE** combinado con los símbolos **"_"** y **"%"** para filtrar, como sigue:

In [ ]:
%sql SELECT nombre AS "nombre_producto", descripcion AS "descripción_producto", precio FROM producto WHERE (precio BETWEEN 10 AND 20) OR ((descripcion LIKE "_itamina") OR (descripcion LIKE "%itaminico%"));

 * sqlite:///love4pets.db
Done.

[('Vitaminas', 'Complemento vitaminico', 5),
 ('Perrarina', 'Huesos', 12),
 ('Gatarina', 'Catspettito', 13),
 ('Consulta', 'Consulta veterinaria', 15)]

La instrucción anterior busca el nombre, descripcion y precio de los productos cuyo precio está entre 10 y 20 euros, la descripción es vitamina con mayúscula o minúscula o contiene la secuencia de caracteres "itaminico", ya que puede ser mayúscula o minúscula la letra v.

### **Ejercicio 5**
--------
*La empresa Love4Pets esta considerando realizar un aumento.*
    
*Se requiere que indique cual es el menor sueldo que está pagando la empresa.*

Para saber cuál es el menor sueldo que está pagando la empresa, en principio tenemos que consultar la tabla **empleado** de **love4pets.db** para conocer si entre sus campos incluye el campo sueldo y así poder consultarlo. Entonces utilizamos la instrucción **PRAGMA table_info(Tabla)**:

In [ ]:
%sql PRAGMA table_info(empleado);

 * sqlite:///love4pets.db
Done.

[(0, 'empleado_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 0, None, 0),
 (4, 'salario', 'INTEGER', 1, None, 0),
 (5, 'fecha_ingreso', 'DATETIME', 1, 'CURRENT_DATE', 0),
 (6, 'departamento_id', 'INTEGER', 0, None, 0)]

Podemos observar que la tabla **empleado** contiene los campos:

*   empleado_id
*   nombre
*   email
*   telefono
*   salario
*   fecha_ingreso
*   departamento_id

Vemos que la tabla tiene el campo **salario**, que significa lo mismo que sueldo, así que sabemos que la consulta la realizaremos sobre dicho campo.
Como esta columna permite registros con valores enteros, podemos utilizar la **función MIN** para obtener el menor valor de la lista de salarios. Entonces, para obtener el menor sueldo que está pagando la empresa realizaremos la siguiente consulta SQL:

In [ ]:
%sql SELECT MIN(salario) AS "menor sueldo" FROM empleado;

 * sqlite:///love4pets.db
Done.

[(1000,)]

El menor sueldo que paga la empresa es de 1000.

### **Ejercicio 6**
--------
*La empresa Love4Pets continúa estudiando un ajuste en los salarios de los empleados, por lo que se quiere conocer el presupuesto total requerido para el pago de los salarios en un año.*

El presupuesto total requerido para el pago de los salarios en un año lo constituye la suma de los salarios mensuales multiplicado por la cantidad de meses del año. Por lo tanto, para obtener el presupuesto total debemos realizar la consulta SQL sobre el campo **salario** de la tabla **empleado** utilizando la **función SUM** que retorna la suma de los valores de la columna seleccionada de la tabla y multiplicarla por 12 (cantidad de meses). Se obtiene, entonces:

In [ ]:
%sql SELECT 12*SUM(salario) AS "presupuesto total" FROM empleado;

 * sqlite:///love4pets.db
Done.

[(210000,)]

Cabe aclarar, que en el enunciado no consigna si la empresa Love4Pets paga 13 o 14 salarios al año como determinan la mayoría de las legislaciones vigentes en la unión europea. Si suponemos que se cumple la legislación con el pago de 14 salarios al año, la consulta SQL se ve alterada de la siguiente manera:

In [ ]:
%sql SELECT 14*SUM(salario) AS "presupuesto total" FROM empleado;

 * sqlite:///love4pets.db
Done.

[(245000,)]

Entonces, el presupuesto total requerido por la empresa para el pago de salarios de un año es de 245000 €.

### **Ejercicio 7**
--------
*Considerando la tabla "cliente" y la tabla "mascota" las cuales tienen una relación uno a muchos. Indique los clientes que no tienen mascota registrada.*

De los ejercicios anteriores conocemos los campos que posee la tabla **cliente**. Sin embargo, no conocemos que datos incluye la tabla **mascota**, por lo que en primer lugar consultaremos la información de esta última utilizando la instrucción **PRAGMA table_info(Tabla)**:

In [ ]:
%sql PRAGMA table_info(mascota);

 * sqlite:///love4pets.db
Done.

[(0, 'mascota_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'cliente_id', 'INTEGER', 1, None, 0),
 (3, 'especie', 'TEXT', 1, None, 0),
 (4, 'raza', 'TEXT', 1, None, 0),
 (5, 'fecha_nacimiento', 'DATETIME', 1, 'CURRENT_DATE', 0)]

Podemos observar que la tabla **mascota** contiene los campos:

*   mascota_id
*   nombre
*   cliente_id
*   especie
*   raza
*   fecha_nacimiento

Donde el campo **mascota_id** es la *clave primaria (primary key)* y el campo **cliente_id** es la *clave foránea (foreign key)*, ya que es clave primaria de la tabla **cliente** como vimos en ejercicios anteriores. Entonces, estas tablas están relacionadas mediante dicha clave foránea y por medio de esta podemos consultar campos de la otra tabla haciendo consultas anidadas o utilizando la cláusula JOIN.

Por lo tanto, para obtener los clientes que tienen o no mascota registrada utilizaremos la consulta SQL con la **cláusula LEFT JOIN**, que nos permite retornar el nombre del cliente de la primera tabla (tabla cliente) y los registros que coinciden con la segunda tabla (tabla mascota), excluyendo los registros que se encuentren en la segunda tabla pero que no hacen match con la primera. Además, como sólo queremos obtener la lista de los que no tienen mascota, utilizamos la **cláusula WHERE** para cuando el campo **nombre** de la tabla **mascota** no tiene valor, es decir es nulo o está vacío.

In [ ]:
%%sql SELECT
cliente.nombre as 'nombre_cliente',
mascota.nombre as 'nombre_mascota'
FROM cliente
LEFT JOIN mascota ON cliente.cliente_id=mascota.cliente_id
WHERE (mascota.nombre IS NULL) OR (mascota.nombre='')

 * sqlite:///love4pets.db
Done.

[('Mario Flores Gallardo', None),
 ('Jan Vargas Santana', None),
 ('Aitor Ruiz Sanchez', None),
 ('Eric Rubio Carrasco', None),
 ('Jesus Medina Hernandez', None),
 ('Pol Moya Pena', None),
 ('Manuel Angel Gil', None)]

En el resultado anterior se muestran todos los clientes que no tienen asociado ningún nombre de mascota, es decir que no tienen mascota. Estos clientes figuran en la tabla1 **cliente** pero no figuran en la tabla2 **mascota**, sin embargo sus nombres se muestran porque se utilizó **LEFT JOIN**. Esto se puede visualizar mejor listando el campo de la *clave foránea* en la consulta y mostrando luego la tabla **mascota** para corroborar.

In [ ]:
%%sql SELECT
cliente.cliente_id as 'id',
cliente.nombre as 'nombre_cliente',
mascota.nombre as 'nombre_mascota'
FROM cliente
LEFT JOIN mascota ON cliente.cliente_id=mascota.cliente_id
WHERE (mascota.nombre IS NULL) OR (mascota.nombre='')

 * sqlite:///love4pets.db
Done.

[(1, 'Mario Flores Gallardo', None),
 (4, 'Jan Vargas Santana', None),
 (9, 'Aitor Ruiz Sanchez', None),
 (10, 'Eric Rubio Carrasco', None),
 (12, 'Jesus Medina Hernandez', None),
 (13, 'Pol Moya Pena', None),
 (15, 'Manuel Angel Gil', None)]

In [ ]:
%sql SELECT * FROM mascota;

 * sqlite:///love4pets.db
Done.

[(1, 'Luna', 2, 'gato', 'mestizo', '2009-01-01 00:00:000'),
 (2, 'Sole', 3, 'gato', 'mestizo', '2010-02-01 00:00:000'),
 (3, 'Mida', 3, 'perro', 'Caint terrier', '2007-02-03 00:00:000'),
 (4, 'Tara', 5, 'perro', 'Puddle', '2006-02-03 00:00:000'),
 (5, 'Pelusa', 6, 'perro', 'Puddle', '2008-02-03 00:00:000'),
 (6, 'irene', 7, 'gato', 'siames', '2015-02-03 00:00:000'),
 (7, 'sara', 8, 'gato', 'mestizo', '2016-05-01 00:00:000'),
 (8, 'milo', 11, 'gato', 'mestizo', '2016-09-01 00:00:000'),
 (9, 'oliver', 11, 'gato', 'mestizo', '2016-07-07 00:00:000'),
 (10, 'Duke', 14, 'perro', 'Pastor Aleman', '2011-05-03 00:00:000')]

### **Ejercicio 8**
--------
*No todas las personas tienen la misma cantidad de mascotas. Se requiere que usted indique el cliente y cantidad de mascotas que tiene cada cliente que tenga mascotas.*

Para responder a esta cuestión utilizaremos una consulta SQL similar a la del ejercicio anterior, pero la diferencia es que ahora nos interesan los clientes que si tienen mascota y contabilizar la cantidad de las mismas por cliente. Es por ello que modificaremos las condiciones de la **cláusula WHERE** y además utilizaremos la instrucción **GROUP BY** y la **función COUNT**.

In [ ]:
%%sql SELECT
cliente.nombre as 'nombre_cliente',
COUNT(mascota.cliente_id) as 'cantidad_de_mascotas'
FROM cliente
LEFT JOIN mascota ON cliente.cliente_id=mascota.cliente_id
WHERE (mascota.nombre IS NOT NULL) OR (mascota.nombre<>'')
GROUP BY cliente.nombre

 * sqlite:///love4pets.db
Done.

[('Alberto Sanz Ruiz', 2),
 ('Arnau Medina Garcia', 1),
 ('Carlos Costa Guerrero', 1),
 ('Gabriel Gonzalez Ortega', 1),
 ('Ivan Medina Rubio', 2),
 ('Jose Gallardo Rodriguez', 1),
 ('Rayan Leon Ferrer', 1),
 ('Roberto Martin Ortega', 1)]

En este ejercicio, luego de la **cláusula LEFT JOIN** se ejecuta la **condición WHERE** para filtrar las filas. Determina qué clientes tienen mascotas (el nombre de las mascota no es nulo o es distinto de vacío). Una vez filtrada las filas, utilizando las cláusula de tipo **GROUP BY** agrupamos las filas *cliente.nombre* donde el registro es el mismo. Finalmente, se aplica la **función COUNT** a cada grupo de filas *mascota.cliente_id* para obtener el número de mascotas de dicho grupo.

### **Ejercicio 9**
--------
*Se requiere que usted indique los clientes que tienen mas de una mascota.*

En este caso la consulta SQL para responder la cuestión es practicamente igual al ejercicio anterior, solamente que le agregamos la instrucción HAVING que nos permite filtrar la búsqueda donde se aplica la función de agregación sobre la condición. Es decir, en este caso sobre GROUP BY, para que seleccione solo los clientes que tienen más de una mascota.

In [ ]:
%%sql SELECT
cliente.nombre as 'nombre_cliente',
COUNT(mascota.cliente_id) as 'cantidad_de_mascotas'
FROM cliente
LEFT JOIN mascota ON cliente.cliente_id=mascota.cliente_id
WHERE (mascota.nombre IS NOT NULL) OR (mascota.nombre<>'')
GROUP BY cliente.nombre HAVING COUNT(mascota.cliente_id)>1

 * sqlite:///love4pets.db
Done.

[('Alberto Sanz Ruiz', 2), ('Ivan Medina Rubio', 2)]

## Conclusiones

---

Se han podido responder satisfactoriamente todas las cuestiones planteadas sobre la actividad de la tienda de productos para mascotas Love4Pets mediante la manipulación y consultas de los datos de la base de datos relacional love4pets.db utilizando el lenguaje SQL en la plataforma Google Colab. Además, se han afianzado conocimientos sobre la sintaxis del lenguaje SQL para insertar y eliminar datos, realizar consultas, trabajar relaciones entre tablas, usar funciones SQL para cálculos y agregación.